{
  "experience": [
    {
      "company": "Pluralsight",
      "role": "Full Stack Software Engineer Intern",
      "description": [
        "• Improved search bar functionality by analyzing 4.1M+ search queries to implement a \"Trending Searches\" feature, increasing user engagement and content discovery through dynamic and relevant query suggestions.",
        "• Designed the trending algorithm using the pandas libary in Python to identify trending search queries by analyzing historical data, using simulations to refine accuracy and reliability.",
        "• Contributed to feature development by breaking work into 22 Agile tasks to streamline implementation and iteration. Documented key design decisions in Confluence for team feedback.",
        "• Collaborated cross-functionally with design and accessibility teams to enhance the overall user experience and ensure the final product was intuitive, responsive, and accessible across all devices.",
        "• Practiced test-driven development, achieving 100% code coverage through unit and integration tests with Jest.",
        "• Automated daily data operations by deploying AWS Lambda functions to populate PostgreSQL table daily."
      ],
      "start": "May 2024",
      "end": "August 2024",
      "url": "https://www.pluralsight.com/"
    },
    {
      "company": "University of Washington",
      "role": "Computer Science Course Facilitator",
      "description": "Facilitate weekly workshops across Data Structures, and Object-Oriented Programming, and Discrete Mathematics courses for a total of 87 students over 5 semesters, strengthening foundational and advanced computer science skills.",
      "start": "January 2024",
      "end": "Present",
      "url": "https://www.tacoma.uw.edu/set/student_resources/support"
    },
    {
      "company": "University of Washington",
      "role": "Math & Computer Science Tutor",
      "description": "Provide individualized support and guidance to a diverse group of students enrolled in advanced computer science and mathematics courses.",
      "start": "April 2023",
      "end": "Present",
      "url": "https://www.tacoma.uw.edu/tlc/quantitative-consultant-biographies"
    },
    {
      "company": "University of Washington",
      "role": "Student Technology Fee Committee Member",
      "description": "Evaluated diverse proposals from various university departments seeking technology funding to enhance student learning experiences and resources. Engaged in transparent discussions during public meetings, articulately presenting the committee's rationale behind funding decisions to the university community.",
      "start": "August 2023",
      "end": "December 2023",
      "url": "https://www.tacoma.uw.edu/student-fees/stf"
    }
  ]
}